РазрешенияНаБСП24/src/Documents/Манифест/Манифест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Манифест</name>
  <posting>Deny</posting>
  <attributes>
    <name>НомерРеестра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТаможенныйПост</name>
    <type>
      <types>CatalogRef.ТаможенныеПосты</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникТаможни</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОбразцов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйПодписант</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойПодписант</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отправления</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.Накладные</types>
      </type>
    </attributes>
    <attributes>
      <name>Грузоотправитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Грузополучатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактурнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазрешенияНаБСП24/src/Documents/Манифест/Forms/ФормаСотриторвкиПоШтрихкоду/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДиалогСВопросом()
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
    ПоказатьВопрос(Оповещение, "При переносе не отсортированные отправления будут потеренны. Продолжить перенос?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Да, "Перенести данные");
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт 		
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПеренестиВДокумент = Истина;
		Закрыть(КодВозвратаДиалога.OK);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФорм

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Документ = Неопределено Тогда
		ВызватьИсключение НСтр("ru='Предусмотрено открытие формы только из документов.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
			ЭтаФорма.АвтоЗаголовок = Ложь;
			ЭтаФорма.Заголовок = Параметры.Заголовок;
	КонецЕсли;

	ПолучитьКопиюОтправленийИзХранилища(Параметры.АдресКопииОтправления);
	
	ИспользоватьПодключаемоеОборудование = ПодключаемоеОборудованиеВызовСервера.ИспользоватьПодключаемоеОборудование();
	
КонецПроцедуры

// Процедура обработчик события ПриОткрытии
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ПеренестиВДокумент Тогда
		АдресОтправленийВХранилище = АдресОтправленийВХранилище(ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	Иначе
		АдресОтправленийВХранилище = Неопределено;
	КонецЕсли;
	
	Если АдресОтправленийВХранилище <> Неопределено Тогда
		Структура = Новый Структура("АдресОтправленийВХранилище", АдресОтправленийВХранилище);
		ОповеститьОВыборе(Структура);
	КонецЕсли;

КонецПроцедуры

// Процедура обработчик события ОбработкаОповещения.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр[1] = Неопределено Тогда
				ТекКод = Параметр[0];
			Иначе
				ТекКод = Параметр[1][1];
			КонецЕсли;
			ОбработатьШтрихкоды(ТекКод);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ШтрихкодыИОборудование

// Функция обрабатывает полученный штрихкод от сканера штрихкодов на клиенте.
//
&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	Штрихкод = ОбщегоНазначенияКлиентСервер.УбратьЛишниеСимволы(ДанныеШтрихкодов, "0123456789");
	
	ОбработатьШтрихкодыНаСервере(Штрихкод);
	
КонецПроцедуры

// Функция обрабатывает полученный штрихкод от сканера штрихкодов на сервере.
//
&НаСервере
Функция ОбработатьШтрихкодыНаСервере(ДанныеШтрихкодов)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номер", ДанныеШтрихкодов);
	НайденноеЗначение = ОтправленияИзДокумента.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденноеЗначение.Количество() = 1 Тогда
		НоваяСтрока = ОтправленияНоваяСортировка.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, НайденноеЗначение[0]);
		ОтправленияИзДокумента.Удалить(НайденноеЗначение[0]);
	ИначеЕсли НайденноеЗначение.Количество() > 1 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Найдено несколько накладных с таким номером");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Накладная с таким номером не найдена");
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если ОтправленияИзДокумента.Количество() = 0 Тогда
		ПеренестиВДокумент = Истина;
		Закрыть(КодВозвратаДиалога.OK);
	Иначе
		ДиалогСВопросом();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличнойЧастиОтправления

&НаКлиенте
Процедура ОтправленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтруктураСтроки = СтруктураСтрокиОтправлений();
	ЗаполнитьЗначенияСвойств(СтруктураСтроки, Элемент.ТекущиеДанные);
	ОтправленияВыборНаСервере(СтруктураСтроки);
	ОтправленияИзДокумента.Удалить(Элемент.ТекущиеДанные);
	
КонецПроцедуры

&НаСервере
Процедура ОтправленияВыборНаСервере(СтруктураСтроки)

	НоваяСтрока = ОтправленияНоваяСортировка.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Функция АдресОтправленийВХранилище(УникальныйИдентификаторВладельца)
	
	АдресВХранилище = Неопределено;
	
	Если ПеренестиВДокумент Тогда
		Отправления = ОтправленияНоваяСортировка.Выгрузить();

		АдресВХранилище = ПоместитьВоВременноеХранилище(Отправления, УникальныйИдентификаторВладельца);
	
	КонецЕсли;
	
	Возврат АдресВХранилище;
	
КонецФункции

&НаСервере
Процедура ПолучитьКопиюОтправленийИзХранилища(ВыбранноеЗначение)
	
	ОтправленияИзДокумента.Загрузить(ПолучитьИзВременногоХранилища(ВыбранноеЗначение));
	
	Для каждого СтрокаОтправления Из ОтправленияИзДокумента Цикл
		СтрокаОтправления.Номер = СтрокаОтправления.Накладная.Номер;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураСтрокиОтправлений() 
	
	СтруктураСтроки = Новый Структура();
	
	СтруктураСтроки.Вставить("Накладная");
	СтруктураСтроки.Вставить("Грузоотправитель");
	СтруктураСтроки.Вставить("Грузополучатель");
	СтруктураСтроки.Вставить("Количество");
	СтруктураСтроки.Вставить("ЕдиницаИзмерения");
	СтруктураСтроки.Вставить("ВесБрутто");
	СтруктураСтроки.Вставить("ВесНетто");
	СтруктураСтроки.Вставить("ФактурнаяСтоимость");
	СтруктураСтроки.Вставить("ТаможеннаяСтоимость");
	СтруктураСтроки.Вставить("Валюта");
	СтруктураСтроки.Вставить("Курс");
	
	Возврат СтруктураСтроки;
	
КонецФункции

#КонецОбласти
